# Taps
tap "bufbuild/buf"
tap "homebrew/bundle"
tap "oven-sh/bun"

# CLI Tools
brew "age"
brew "automake"
brew "buf"
brew "bun"
brew "cask"
brew "docker-compose"
brew "emacs"
brew "gh"
brew "git"
brew "go"
brew "gradle"
brew "grpcurl"
brew "istioctl"
brew "jq"
brew "kubectx"
brew "kubeseal"
brew "mkcert"
brew "mysql"
brew "nano"
brew "node"
brew "nodenv"
brew "ory-hydra"
brew "peco"
brew "python@3.12"
brew "ripgrep"
brew "sops"
brew "tmux"
brew "uv"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Applications (Casks)
cask "1password"
cask "alfred"
cask "antigravity"
cask "apidog"
cask "caffeine"
cask "chatgpt"
cask "cursor"
cask "cyberduck"
cask "docker"
cask "google-chrome"
cask "google-drive"
cask "hammerspoon"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "kiro"
cask "logi-options+"
cask "notion"
cask "slack"
cask "zoom"
